examples/Data/datasets/xml/4E1EC16C2AD111E88B6964C920524153/record-1.xml

<?xml version="1.0" encoding="utf-8"?> 
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"> 
    <SOAP-ENV:Header> 
        <ns2:MessageHeader xmlns="http://csi.cingular.com/CSI/Namespaces/Types/Public/CingularDataModel.xsd" xmlns:ns2="http://csi.cingular.com/CSI/Namespaces/Types/Public/MessageHeader.xsd">
            <ns2:TrackingMessageHeader>
                <version>v106</version>
                <messageId>myAttSales_DESKTOP_5f24bf72-6919-a103-6deb-c098d661efb5-1_135.163.193.233_6</messageId>
                <timeToLive>0</timeToLive>
                <dateTimeStamp>2017-11-22T13:16:08.105Z</dateTimeStamp>
            </ns2:TrackingMessageHeader>
            <ns2:SecurityMessageHeader>
                <userName>buyonline</userName>
                <userPassword>buyonline504</userPassword>
            </ns2:SecurityMessageHeader>
            <ns2:SequenceMessageHeader>
                <sequenceNumber>1</sequenceNumber>
                <totalInSequence>1</totalInSequence>
            </ns2:SequenceMessageHeader>
        </ns2:MessageHeader> 
    </SOAP-ENV:Header> 
    <SOAP-ENV:Body> 
        <ValidateCreditCardRequest xmlns="http://csi.cingular.com/CSI/Namespaces/Container/Public/ValidateCreditCardRequest.xsd" xmlns:ns2="http://csi.cingular.com/CSI/Namespaces/Types/Public/CingularDataModel.xsd" xmlns:ns3="http://csi.cingular.com/CSI/Namespaces/Container/Public/InquireUnifiedCustomerLoginProfileResponse.xsd">
            <mode>3</mode>
            <Name>
                <ns2:firstName>JOE</ns2:firstName>
                <ns2:lastName>BARRET</ns2:lastName>
            </Name>
            <CreditInformationSelector>
                <ns2:CreditCard>
                    <ns2:CardNumber>
                        <ns2:creditCardNumber>5442981111111114</ns2:creditCardNumber>
                    </ns2:CardNumber>
                    <ns2:creditCardExpirationDate>1712</ns2:creditCardExpirationDate>
                    <ns2:Address>
                        <ns2:CreditCardBillingAddress>
                            <ns2:addressType>S</ns2:addressType>
                            <ns2:Zip>
                                <ns2:zipCode>75081</ns2:zipCode>
                            </ns2:Zip>
                            <ns2:Country>US</ns2:Country>
                        </ns2:CreditCardBillingAddress>
                    </ns2:Address>
                    <ns2:security>234</ns2:security>
                </ns2:CreditCard>
            </CreditInformationSelector>
            <Source>
                <ns2:sourceSystem>UROCK</ns2:sourceSystem>
                <ns2:sourceLocation>CS</ns2:sourceLocation>
                <ns2:sourceUser>UROCK</ns2:sourceUser>
            </Source>
        </ValidateCreditCardRequest> 
    </SOAP-ENV:Body> 
</SOAP-ENV:Envelope> 